#include <stdio.h>
#include <locale>

int main(void) {
    char name1[20], name2[20], name3[20];
    char teamCode1, teamCode2, teamCode3;
    float score1, score2, score3;
    unsigned short place1, place2, place3;
    
    /* Введення фактичних даних */
    printf("1. Введіть: прізвище учасника, код команди, кількість балів, місце у результаті >");
    scanf("%s %c %f %hd", name1, &teamCode1, &score1, &place1);
    
    printf("2. Введіть: прізвище учасника, код команди, кількість балів, місце у результаті >");
    scanf("%s %c %f %hd", name2, &teamCode2, &score2, &place2);
    
    printf("3. Введіть: прізвище учасника, код команди, кількість балів, місце у результаті >");
    scanf("%s %c %f %hd", name3, &teamCode3, &score3, &place3);
    
    /* Виведення таблиці */
    printf("----------------------------------------------------\n");
    printf("|Відомість спортивних змагань                      |\n");
    printf("|--------------------------------------------------|\n");
    printf("|      Прізвище  |  Код  | Кількість |   Місце у   |\n");
    printf("|      учасника  |команди|  балів    | результаті  |\n");
    printf("|----------------|-------|-----------|-------------|\n");
    
/* виведення рядків фактичних даних */
printf("| %-14s | %-5c | %-9.1f | %-11.1hd |\n", name1, teamCode1, score1, place1);
printf("| %-14s | %-5c | %-9.2f | %-11.1hd |\n", name2, teamCode2, score2, place2);
printf("| %-14s | %-5c | %-9.1f | %-11.1hd |\n", name3, teamCode3, score3, place3);
    
    /* виведення приміток */
    printf("|--------------------------------------------------|\n");
    printf("|Примітка:Д – “Динамо”, С – “Спартак”,             |\n");
    printf("| Ш – “Шахтар”                                     |\n");
    printf("----------------------------------------------------\n");
    
    return 0;
}